/********************************************************
 タイマドライバ
 *******************************************************/
#include <avr/io.h>
#include "timer.h"

/*****************************************
 define
*****************************************/

/*****************************************
 関数プロトタイプ宣言
*****************************************/

/*****************************************
 変数宣言
*****************************************/
static TimerTimeType timer_counter; /* タイマー本体 */

/*****************************************
 タイマー初期化(タイマ:TC0)
*****************************************/
void timer_init(void)
{
    timer_counter = 0;

    /* 1msタイマ設定 */
    TCCR0A = 0x02;
    /* COM0A1,0 : 比較A出力選択 00(標準ポート動作) */
    /* COM0B1,0 : 比較B出力選択 00(標準ポート動作) */
    /* WGM01,0 : 波形生成種別下位2ビット 10(比較一致タイマ/カウンタ解除(CTC)動作) */
    TCCR0B = 0x00;
    /* FOC0A : OC0A強制変更 0 (なし) */
    /* FOC0B : OC0B強制変更 0 (なし) */
    /* WGM02 : 波形生成種別上位1ビット 0 (比較一致タイマ/カウンタ解除(CTC)動作) */
    /* CS02,01,00 : タイマが開始してしまうため、タイマ開始時に設定 */
    TCNT0 = 0x00;   /*  カウンタクリア */
    OCR0A = 249;    /*  CPU16MHz 64分周 で1msを計測できるカウント */

    /*  タイマ開始 */
    TCCR0B = 0x03;      /* CS02,01,00 : 011 64分周 */
}

/*****************************************
 タイマーカウント
*****************************************/
void timer_tick(void)
{
    timer_counter++; /* タイマーをカウントする */
}

/*****************************************
 タイマー設定
*****************************************/
void timer_set(TimerTimeType after_time, TimerTimeType *timer)
{
    *timer = timer_counter + after_time;
}

/*****************************************
 タイマー完了確認
*****************************************/
TimerStateType timer_is_finished(TimerTimeType timer)
{
    TimerStateType is_finished;
    if (timer_counter > timer) {
        is_finished = TimerFinished;
    } else {
        is_finished = TimerRunning;
    }
    return is_finished;
}

/*****************************************
 1ms ウェイト
*****************************************/
void timer_wait_1ms(void)
{
    while( (TIFR0 & _BV(OCF0A)) == 0x00);   /*  1msタイマ発火まで待つ */
    TIFR0 = _BV(OCF0A);                     /*  書き込みにより割り込み要求フラグをクリア */
}
