/********************************************************
 *  組み込み実装サンプルプログラム                      *
 *  ファイル名：accelerator_pedal.c                     *
 *  内容：     アクセルペダル                           *
 *  日付：     2019/06/13                               *
 *  note:                                               *
 *  作成者：yamashita_y                                 *
 *******************************************************/
#include "accelerator_pedal.h"

#include "drivers/input_adc.h"

/*****************************************
 define
*****************************************/

/*****************************************
 関数プロトタイプ宣言
*****************************************/

/*****************************************
 変数宣言
*****************************************/
static unsigned char position;

/*****************************************
 初期化
*****************************************/
void accelpedal_init(void)
{
    position = 0;
}

/*****************************************
 メインタスク
*****************************************/
void accelpedal_input(void)
{
    unsigned char vr;
    
    vr = adc_get_vr_nrm();
    position = ((unsigned short)vr * 100) / 255;    /* アクセルペダルの値域[0～100]に変換 */
}

/*****************************************
 アクセルペダル位置取得
*****************************************/
unsigned char accelpedal_get(void)
{
    return position;
}
