/********************************************************
 *  組み込み実装サンプルプログラム                      *
 *  ファイル名：ev_engine.c                             *
 *  内容：     エンジン&モーター                        *
 *  日付：     2019/06/13                               *
 *  note:                                               *
 *  作成者：yamashita_y                                 *
 *******************************************************/
#include "ev_engine.h"

#include "drivers/output_pwm.h"

/*****************************************
 define
*****************************************/
#define PERIOD_IN_US 100000    /* [us] */

/*****************************************
 関数プロトタイプ宣言
*****************************************/

/*****************************************
 変数宣言
*****************************************/
static unsigned char ouput_ratio;

/*****************************************
 初期化
*****************************************/
void engine_init(void)
{
    pwm_set_duty(PERIOD_IN_US, 0);
    pwm_motor_on();

    ouput_ratio = 0;
}

/*****************************************
 メインタスク
*****************************************/
void engine_output(void)
{
    pwm_set_duty(PERIOD_IN_US, ouput_ratio);
}

/*****************************************
 エンジン&モーター出力設定
*****************************************/
void engine_set(unsigned char ratio)
{
    ouput_ratio = ratio;
}
