/********************************************************
 *  組み込み実装サンプルプログラム                      *
 *  ファイル名：indicatior.c                            *
 *  内容：     インジケータ                             *
 *  日付：     2019/06/13                               *
 *  note:                                               *
 *  作成者：yamashita_y                                 *
 *******************************************************/
#include "indicator.h"

#include "drivers/output_led.h"

/*****************************************
 define
*****************************************/
#define ENGINE_BIT (LED_BIT_POS0)
#define READY_BIT (LED_BIT_POS1)
#define IG_ON_BIT (LED_BIT_POS2)
#define ACC_BIT (LED_BIT_POS3)

/*****************************************
 関数プロトタイプ宣言
*****************************************/

/*****************************************
 変数宣言
*****************************************/

/*****************************************
 初期化
*****************************************/
void indicator_init(void)
{
    /* None */
}

/*****************************************
 メインタスク
*****************************************/
void indicator_output(void)
{
    /* None */
}

/*****************************************
 ENG表示点灯
*****************************************/
void engine_display_on(void)
{
    led_set_bit(ENGINE_BIT);
}

/*****************************************
 ENG表示消灯
*****************************************/
void engine_display_off(void)
{
    led_clear_bit(ENGINE_BIT);
}

/*****************************************
 READY表示点灯
*****************************************/
void ready_display_on(void)
{
    led_set_bit(READY_BIT);
}

/*****************************************
 READY表示消灯
*****************************************/
void ready_display_off(void)
{
    led_clear_bit(READY_BIT);
}

/*****************************************
 IG ON表示点灯
*****************************************/
void ig_on_display_on(void)
{
    led_set_bit(IG_ON_BIT);
}

/*****************************************
 IG ON表示消灯
*****************************************/
void ig_on_display_off(void)
{
    led_clear_bit(IG_ON_BIT);
}

/*****************************************
 ACC表示点灯
*****************************************/
void acc_display_on(void)
{
    led_set_bit(ACC_BIT);
}

/*****************************************
 ACC表示消灯
*****************************************/
void acc_display_off(void)
{
    led_clear_bit(ACC_BIT);
}