/********************************************************
 *  組み込み実装サンプルプログラム                      *
 *  ファイル名：parking_break.c                         *
 *  内容：     パーキングブレーキ                       *
 *  日付：     2019/06/13                               *
 *  note:                                               *
 *  作成者：yamashita_y                                 *
 *******************************************************/
#include "parking_break.h"

#include "drivers/input_toggle.h"

/*****************************************
 define
*****************************************/
#define PBREAK_BIT (TOGGLE_BIT_POS1)

/*****************************************
 関数プロトタイプ宣言
*****************************************/

/*****************************************
 変数宣言
*****************************************/

/*****************************************
 初期化
*****************************************/
void pbreak_init(void)
{
    /* None */
}

/*****************************************
 パーキングブレーキ状態取得
*****************************************/
PbreakStateType pbreak_get(void)
{
	PbreakStateType state;
    unsigned char onoff;

    onoff = toggle_get_state();
    if ((onoff & PBREAK_BIT) != 0) {
        state = en_BreakOn;    /* トグルスイッチの位置が右 */
    } else {
        state = en_BreakOff;    /* トグルスイッチの位置が左 */
    }
	return state;
}
