/********************************************************
 *  組み込み実装サンプルプログラム                      *
 *  ファイル名：shift_position.c                        *
 *  内容：     シフトポジション                         *
 *  日付：     2019/06/13                               *
 *  note:                                               *
 *  作成者：yamashita_y                                 *
 *******************************************************/
#include "shift_position.h"

#include "drivers/input_toggle.h"

/*****************************************
 define
*****************************************/
#define SHIFTPOS_BIT (TOGGLE_BIT_POS0)

/*****************************************
 関数プロトタイプ宣言
*****************************************/

/*****************************************
 変数宣言
*****************************************/

/*****************************************
 初期化
*****************************************/
void shiftpos_init(void)
{
    /* None */
}

/*****************************************
 シフトポジション状態取得
*****************************************/
ShiftPosType shiftpos_get(void)
{
	ShiftPosType position;
    unsigned char onoff;

    onoff = toggle_get_state();
    if ((onoff & SHIFTPOS_BIT) != 0) {
        position = en_Parking;    /* トグルスイッチの位置が右 */
    } else {
        position = en_Drive;    /* トグルスイッチの位置が左 */
    }
	return position;
}
